app/controllers/messages_controller.rb

  def create
    @message = Message.new(post_params)
    if @message.save
---
INSERT INTO "messages" ("company", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["company", "CPS"], ["body", "123"], ["created_at", "2020-10-29 16:04:21.614894"], ["updated_at", "2020-10-29 16:04:21.614894"]]